package DAY10.word;

public class WordMain2 {

	public static void main(String[] args) {
		/* 영어 단어장 프로그램 만들기
		 * 1. 기능 정리
		 * - 단어는 영어 단어와 한글 뜻으로 구성
		 * - 영어 다어는 영어이고, 공백이 없는 단어
		 * - 한글 뜻은 한글이고, 한 문장으로 되어 있다
		 *  - 한 단어에 뜻이 한개만 있다고 가정
		 *  
		 *  - 기능
		 *  - 단어 등록
		 *  - 단어 검색
		 *  - 단어 수정
		 *  - 단어 삭제
		 *  
		 *  - Word 클래스
		 *  - word : 영단어
		 *  - meaning : 뜻
		 *  - 단어 출력 , 단어 수정, 단어 확인: 주어진 문자열과 같은 단어인지 확인
		 *  
		 *  2. 틀 작성
		 *  
		 *  
		 *  
		 *  3. 필요한 메서드 구현
		 *  
		 *  
		 */
	}

}
