package TeamHw1;

public class HomeWorkEx1 {	

	public static void main(String[] args) {
		/* 영어 단어장을 관리하는 프로그램을 작성하세요.
		 * 기한은 1/5까지 github에 업로드 후 강사에게 공유(단톡방)
		 * - 한 단어에 뜻이 여러개 있을 수 있음
		 * - 단어, 품사, 뜻을 관리
		 * - 단어 추가
		 * - 단어 수정
		 * - 단어 삭제
		 * - 뜻 추가
		 * - 뜻 수정
		 * - 뜻 삭제
		 * - 단어 조회
		 * 
		 * - 기타 추가 기능을 구현해도 됨
		 * - 등록된 단어장에서 랜덤으로 문제가 나오고 맞추는 기능
		 * - 오답 노트를 관리하는 기능 
		 * - 많이 조회한 단어를 확인하는 기능
		 * */
		
		
		/*추가 기능없음 int num을 통해 해당 단어와 뜻으로 구분함
		 *num 1이면 단어, 0이면 뜻
		 *단어 입력시 단어,품사,뜻 순으로 비우지 말고 입력한다
		 *삭제 기능은 스펠링이나 품사나 뜻 만 삭제하는 경우는 없으며, 삭제를 원하면 단어를 입력해 전체를 지운다
		 *수정 기능은 구현한다: 스펠링, 품사, 뜻
		 *조회 기능은 단어 입력해서 해당 단어만 조회하는 기능만 구현한다
		 */
		HomeWork hw=new HomeWork();
		
		hw.run();
				
		
	}

}

