package DAY09;

// 8일차 복습

/* 멤버변수
 * 자동으로 각 자료형에 맞는 기본값으로 초기화
 * 같은 클래스 안에서 자유롭게 사용 가능(단 ,특수상황)
 * 다른 클래스 에서는 안스턴스를 생성해서 호출(단, 접근 제어자에 따라 달라질 수 있음)
 *  
 *  메서드
 *  기능
 *  매개변수 : 메서드를 실행하기 위해  꼭 필요한 정보
 *  리턴타입 : 함수값의 타입
 *  메서드명 : 카멜표기법 EX) student + count => studentCount
 *  
 *  메서드 장점
 *  구조 파악 쉬움
 *  재사용 통해서 코드의 중복을 제거
 *  
 *  메서드 오버로딩
 *  가능은 같은데 매개변수가 다른 경우에 쓰기 위해서
 *  이름이 같은 메서드가 2개 이상인 경우
 *  조건 : 매개변수가 다른 경우
 *  1. 매개변수의 개수가 다른 경우
 *  2. 매개변수의 타입이 다른 경우
 *  
 *  가변 매개변수 메서드
 *  매개변수의 개수가 고정이 아님
 *  자료형... 변수명으로 사용
 *  메서드 안에서는 배열처럼 사용
 *  
 *  생성자 
 *  이름이 클래스명과 같다
 *  생성자는 new 를 통해 객체를 생성할 때만 호출 가능
 *  멤버변수를 초기화 함
 *  클래스에 생성자가 1도 없으면 기본 생성자가 자동으로 추가
 *  
 *  접근제어자
 *  1.private : 해당 클래스
 *  2.default : 해당 클래스 + 같은 패키지
 *  3.protected : 해당클래스 + 같은 패키지 + 자식 클래스
 *  4.public : 모두
 *  
 *  멤버 변수 : 일반적으로 private( 고정 상수는 public)
 *  메서드, 생성자 : 일반적으로 public
 *  메서드는 같은 클래스에서 다른 메서드에서만 사용되고, 밖에서는 사용될 필요가 없는 경우에는 private
 *  생서자는 싱글톤은 private */
